nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz1025dag176.h
PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptDisable_Default(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, bool intEnable, bool inBetweenOrEqual, bool greaterEqualHi, bool lessThanHi, bool greaterEqualLo, bool lessThanLo, ADCHS_AN_INPUT_ID analogInput, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorSetup_Default(index, id, intEnable, inBetweenOrEqual, greaterEqualHi, lessThanHi, greaterEqualLo, lessThanLo, analogInput, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalComparatorEventHasOccurred(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id)
{
     return ADCHS_DigitalComparatorEventHasOccurred_Default(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorLimitSet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorLimitSet_Default(index, id, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalComparator(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalComparator_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterEnable_Default(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterDisable_Default(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio, bool intEnable)
{
     ADCHS_DigitalFilterOversamplingModeSetup_Default(index, id, analogInput, length, ratio, intEnable);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count, bool intEnable)
{
     ADCHS_DigitalFilterAveragingModeSetup_Default(index, id, analogInput, length, count, intEnable);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeRatioSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio)
{
     ADCHS_DigitalFilterOversamplingModeRatioSelect_Default(index, id, ratio);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSampleCountSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count)
{
     ADCHS_DigitalFilterAveragingModeSampleCountSelect_Default(index, id, count);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalFilterDataIsReady(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     return ADCHS_DigitalFilterDataIsReady_Default(index, id);
}

PLIB_INLINE_API int16_t PLIB_ADCHS_DigitalFilterDataGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID dfltrID)
{
     return ADCHS_DigitalFilterDataGet_Default(index, dfltrID);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptEnable_Default(index, digFilter);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptDisable_Default(index, digFilter);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalFilter(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalFilter_Default(index);
}

PLIB_INLINE_API int32_t PLIB_ADCHS_FIFORead(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFORead_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_FIFODataIsAvailable(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataIsAvailable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_FIFODataReadyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODataReadyInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_FIFODataReadyInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODataReadyInterruptDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_FIFOEnable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFOEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_FIFODisable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_FIFOSourceSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_FIFOSourceSelect_Default(index, channelID);
}

PLIB_INLINE_API uint8_t PLIB_ADCHS_FIFODataCountGet(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataCountGet_Default(index);
}

PLIB_INLINE_API ADCHS_CHANNEL_ID PLIB_ADCHS_FIFOSourceGet(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFOSourceGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_FIFOErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFOErrorHasOccurred_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_FIFODataIsNegative(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataIsNegative_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsFIFO(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsFIFO_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_DMAEnable(ADCHS_MODULE_ID index)
{
     ADCHS_DMAEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_DMADisable(ADCHS_MODULE_ID index)
{
     ADCHS_DMADisable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_DMASetup(ADCHS_MODULE_ID index, ADCHS_DMA_BUFFER_LENGTH bufferLengthBytes, uint32_t baseAddress, ADCHS_DMA_COUNT countMode, uint32_t countBaseAddress)
{
     ADCHS_DMASetup_Unsupported(index, bufferLengthBytes, baseAddress, countMode, countBaseAddress);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMASourceEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMASourceEnable_Unsupported(index, channelID);
}

